-----------------------------------------------------------------
-- TX0002
-----------------------------------------------------------------

-----------------------------------------------------------------
-- drop TX0002
-----------------------------------------------------------------

drop table TX0002;

-----------------------------------------------------------------
-- create TX0002
-----------------------------------------------------------------

create table TX0002 (
    COL1 CHAR(8) not null,
    COL1_1 CHAR(8) not null,
    COL2 DECIMAL(10,2),
    COL3 INTEGER,
    COL4 VARCHAR(20),
    -- プライマリキー
    primary key (COL1, COL1_1)
);



-- テーブルコメント
comment on table TX0002 is 'テストテーブル2';

-- カラムコメント
comment on column TX0002.COL1 is 'テスト列1';
comment on column TX0002.COL1_1 is 'テスト列1_枝番';
comment on column TX0002.COL2 is 'テスト列2';
comment on column TX0002.COL3 is 'テスト列3';
comment on column TX0002.COL4 is 'テスト列4';

------------------------- END OF FILE ---------------------------

