-----------------------------------------------------------------
-- TX0001
-----------------------------------------------------------------

-----------------------------------------------------------------
-- drop TX0001
-----------------------------------------------------------------

drop table TX0001;

-----------------------------------------------------------------
-- create TX0001
-----------------------------------------------------------------

create table TX0001 (
    COL1 CHAR(8) not null,
    COL2 DECIMAL(10,2),
    COL3 INTEGER,
    COL4 VARCHAR(20),
    -- プライマリキー
    primary key (COL1)
);



-- テーブルコメント
comment on table TX0001 is 'テストテーブル1';

-- カラムコメント
comment on column TX0001.COL1 is 'テスト列1';
comment on column TX0001.COL2 is 'テスト列2';
comment on column TX0001.COL3 is 'テスト列3';
comment on column TX0001.COL4 is 'テスト列4';

------------------------- END OF FILE ---------------------------

